import React from "react";
import Footer from "../components/footer";
import MiniNavbar from "../components/miniNavbar";
import styles from './school.module.css';
import Schedule from "../components/schedule";



const School = () => {

    const latitude = "42.02957813286708";
    const longitude = "20.64487018727573";

    // Dodaj zoom parametar u URL da bi povećao mapu
    const schoolLocation = `https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d10789.80905111165!2d${longitude}!3d${latitude}!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x4754d4f41a71ffb7%3A0x53d7e6cf8db4b40!2sYour%20School%20Name!5e0!3m2!1sen!2sus!4v1663234212364!5m2!1sen!2sus&zoom=14` 

    return (
        <div className={styles.container}>
            
            <div className={styles.aboutSchool}>
                <h1 className={styles.Header}>О Школи</h1>
                <h5>Економско-трговачка школа налази се у месту Драгаш и образује ученике на четворогодишњим смеровима, кроз три подручја рада: економија, право и администрација, трговина, угоститељство, туризам и гимназија.</h5><br/>
                <h5>Лорем ипсум долор сит амет консектетур адиписицинг елит. Максиме молитиа, молестиае квас вел синт цоммоди репудиандае консеквунтур волуптатум лабораторум нумквам бландитиис харум квискуам ејус сед одит фугиат иусто фуга praesentium оптио, еакуе рерум!</h5><br/>
                <h5>Провидент симиликуе акусантиум немо аутем. Вератис обцаецати тенетур июре ејус еарум ут молестиас архитекто волуптате аликам нихил, евениет аликуид цулпа оффициа аут! Импедит сит сунт куаерат, одит, тенетур еррор, харум несциунт ипсум дебитис квас аликуид. Репрехендерит, quia. Кво неqуе еррор репудиандае фуга? </h5><br/>
                <h5>Провидент симиликуе акусантиум немо аутем. Вератис обцаецати тенетур июре ејус еарум ут молестиас архитекто волуптате аликам нихил, евениет аликуид цулпа оффициа аут! Импедит сит сунт куаерат, одит, тенетур еррор, харум несциунт ипсум дебитис квас аликуид. Репрехендерит, quia. Кво неqуе еррор репудиандае фуга?</h5><br/>
                <h5>Провидент симиликуе акусантиум немо аутем. Вератис обцаецати тенетур июре ејус еарум ут молестиас архитекто волуптате аликам нихил, евениет аликуид цулпа оффициа аут! Импедит сит сунт куаерат, одит, тенетур еррор, харум несциунт ипсум дебитис квас аликуид. Репрехендерит, quia. Кво неqуе еррор репудиандае фуга?</h5><br/>
                <h5>Провидент симиликуе акусантиум немо аутем. Вератис обцаецати тенетур июре ејус еарум ут молестиас архитекто волуптате аликам нихил, евениет аликуид цулпа оффициа аут! Импедит сит сунт куаерат, одит, тенетур еррор, харум несциунт ипсум дебитис квас аликуид. Репрехендерит, quia. Кво неqуе еррор репудиандае фуга?</h5>
                <h1 >Мисија и визија школе</h1>
                <h5>Ми смо мала школа у Гори која се континуирано и плански развија и утолико је наша одговорност већа за припремање младих за школовање на факултетима, чиме обезбеђујемо Гори будући кадар, па је развој ове школе од стратешког интереса за развој наше Горе у целини.</h5>
                <h5>Мисија наше школе је опште образовање  и  васпитавање младих људи које ће их оспособити за даљи наставак школовања и које ће их припремити да одговоре захтевима времена у којем живе и у којем ће градити  професионалну каријеру. Наша визија је да будемо школа у којој је настава подстицајна, стечена знања функционална, окружење сигурно, односи засновани на уважавању и поштовању и сарадња са родитељима.</h5>
                <h1>Ритам рада</h1>
                <h5>У школи се настава изводи у једној смени. Прва смена теоријске наставе почиње у 7.05 и завршава се у 13.10 часова, а друга смена почиње у 13.15 и завршава се у 19.15 часова.</h5>
                <h3>Настава се изводи по следећој сатници:</h3>
                <Schedule />
            </div>
            <div className={styles.Location}>
                <h2>Локација школе</h2>
                <iframe 
                    src={schoolLocation} 
                    width="800" 
                    height="600" 
                    style={{ border: 0 }} 
                    allowFullScreen 
                    loading="lazy">
                </iframe>
            </div>
            
        </div>
    );
}

export default School;
